БИТУправление_медицинским_центром_демо/src/Documents/РеестрОказанныхУслугПоСоглашениям/РеестрОказанныхУслугПоСоглашениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеестрОказанныхУслугПоСоглашениям</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСтрахования</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Полис</name>
      <type>
        <types>CatalogRef.СтраховыеПолисы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Диагноз</name>
      <type>
        <types>CatalogRef.Диагнозы</types>
      </type>
    </attributes>
    <attributes>
      <name>Зуб</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СегментЗуба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПродажи</name>
      <type>
        <types>DocumentRef.ОказаниеУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ПараметрыПродажПоСтраховымПрограммам/ПараметрыПродажПоСтраховымПрограммам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыПродажПоСтраховымПрограммам</name>
  <resources>
    <name>Диагноз</name>
    <type>
      <types>CatalogRef.Диагнозы</types>
    </type>
  </resources>
  <resources>
    <name>Зуб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СегментЗуба</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияПриема</name>
    <type>
      <types>EnumRef.СпособыОпределенияПриемаДляПродажПоСтраховымПрограммам</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияДиагноза</name>
    <type>
      <types>EnumRef.СпособыОпределенияДиагнозаДляПродажПоСтраховымПрограммам</types>
    </type>
  </attributes>
  <attributes>
    <name>Прием</name>
    <type>
      <types>DocumentRef.Прием</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <comment>Врач</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ОказаниеУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяТЧ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/ПродажиПоСтраховымПолисам/ПродажиПоСтраховымПолисам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажиПоСтраховымПолисам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоглашениеСКонтрагентом</name>
    <type>
      <types>CatalogRef.СоглашенияСтрахования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Полис</name>
    <type>
      <types>CatalogRef.СтраховыеПолисы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыПолисов/ВидыПолисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыПолисов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеСтрахования</name>
    <comment>(устарел. см. таб.часть Договоры)</comment>
    <type>
      <types>CatalogRef.СоглашенияСтрахования</types>
    </type>
  </attributes>
  <attributes>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетОстаткаПоГарантийнымПисьмам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитированноеНаправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставСтрахуемыхФиксируетсяДокументально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеестрТребуетМедицинскихПараметров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьУказыватьПараметрыЗубов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксироватьДолгКонтрагентаПриПроведенииРеестраОУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыСтраховыхПрограмм</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетПлатныхМатериаловОбособленноОтУслуг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьНаличиеЦеныВПрейскуранте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставПолисаОпределяетсяПрейскурантом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.СоглашенияСтрахования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Documents/РеестрОказанныхУслугПоСоглашениям/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает доступные варианты печати документа.
//  Результатом является Струткура, каждая строка которой соответствует одному из вариантов печати.
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("РеестрОказаныхУслуг"	,"Реестр");
	
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура формирует печатную форму документа
//  Название макета печати передается в качестве параметра,
//  по переданному имени макета определяется соответствующая функция печати.
//
// Параметры:
//  СсылкаНаОбъект	 - ДокументСсылка	 - ссылка на распечатываемый документ.
//  ИмяМакета		 - Строка			 - имя макета из структуры печатных форм.
// 
// Возвращаемое значение:
//	ТабличныйДокумент.
//
Функция Печать(СсылкаНаОбъект, ИмяМакета) Экспорт
	
	Перем ТабДокумент;
	
	// Получить экземпляр документа на печать.
	Если ИмяМакета = "РеестрОказаныхУслуг" Тогда
		ТабДокумент = ПечатьРеестраОказаныхУслуг(СсылкаНаОбъект);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

// Заполняет состав услуг документа за период по шапке документа.
//
// Параметры:
//  ДокументОбъект	 - ДокументСсылка.РеестрОказанныхУслугПоСоглашениям	 - реестр.
//
Процедура ЗаполнитьСоставУслугДокумента(ДокументОбъект) Экспорт
	
	Договор = ДокументОбъект.Соглашение;
	Если ЗначениеЗаполнено(Договор.ДатаНачала) Тогда
		НачалоПериода = Макс(Договор.ДатаНачала, ДокументОбъект.НачалоПериода);
	Иначе
		НачалоПериода = ДокументОбъект.НачалоПериода;
	КонецЕсли;
	Если ЗначениеЗаполнено(Договор.ДатаОкончания) Тогда
		КонецПериода = Мин(Договор.ДатаОкончания, ДокументОбъект.КонецПериода);
	Иначе
		КонецПериода = ДокументОбъект.КонецПериода;
	КонецЕсли;
	
	// Из регистра накопления берутся продажи по видам полисам, не требующим указания медицинских параметров продаж,
	// а также данные тех документов с полисами, требующими указания, по которым не было строк 
	// в регистре ПараметрыПродажПоСтраховымПрограммам (например, прошлый месяц после включения признака требования).
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыПолисов.Ссылка КАК ВидПолиса,
	               |	ВидыПолисов.РеестрТребуетМедицинскихПараметров
	               |ПОМЕСТИТЬ ВидыПолисов
	               |ИЗ
	               |	Справочник.ВидыПолисов КАК ВидыПолисов
	               |ГДЕ
	               |	ВидыПолисов.Договоры.Договор = &СоглашениеСтрахования
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПараметрыПродажПоСтраховымПрограммам.Документ,
	               |	ПараметрыПродажПоСтраховымПрограммам.Документ.Дата КАК Дата,
	               |	ПараметрыПродажПоСтраховымПрограммам.Диагноз,
	               |	ПараметрыПродажПоСтраховымПрограммам.Зуб,
	               |	ПараметрыПродажПоСтраховымПрограммам.СегментЗуба,
	               |	ПараметрыПродажПоСтраховымПрограммам.Комментарий,
	               |	ПараметрыПродажПоСтраховымПрограммам.Номенклатура,
	               |	ПараметрыПродажПоСтраховымПрограммам.Количество,
	               |	ПараметрыПродажПоСтраховымПрограммам.Сумма,
	               |	ПараметрыПродажПоСтраховымПрограммам.Сотрудник,
	               |	ПараметрыПродажПоСтраховымПрограммам.Документ.Документ КАК Полис,
	               |	ПараметрыПродажПоСтраховымПрограммам.Документ.Клиент КАК Клиент,
	               |	ПараметрыПродажПоСтраховымПрограммам.Проверено
	               |ПОМЕСТИТЬ ПродажиСПараметрами
	               |ИЗ
	               |	РегистрСведений.ПараметрыПродажПоСтраховымПрограммам КАК ПараметрыПродажПоСтраховымПрограммам
	               |ГДЕ
	               |	ПараметрыПродажПоСтраховымПрограммам.Документ.Дата МЕЖДУ &ПериодНач И &ПериодКон
	               |	И ПараметрыПродажПоСтраховымПрограммам.Документ.Филиал.Организация = &Организация
	               |	И ПараметрыПродажПоСтраховымПрограммам.Документ.Документ.ВидПолиса В
	               |			(ВЫБРАТЬ
	               |				ВидыПолисов.ВидПолиса
	               |			ИЗ
	               |				ВидыПолисов
	               |			ГДЕ
	               |				ВидыПолисов.РеестрТребуетМедицинскихПараметров)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПродажиСПараметрами.Документ
	               |ПОМЕСТИТЬ ДокументыПродажСПараметрами
	               |ИЗ
	               |	ПродажиСПараметрами КАК ПродажиСПараметрами
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиПоСтраховымПолисам.Полис,
	               |	ПродажиПоСтраховымПолисам.Полис.Владелец КАК Клиент,
	               |	ПродажиПоСтраховымПолисам.Номенклатура,
	               |	ПродажиПоСтраховымПолисам.Сотрудник,
	               |	ПродажиПоСтраховымПолисам.Количество,
	               |	ПродажиПоСтраховымПолисам.Сумма,
	               |	ПродажиПоСтраховымПолисам.Период КАК Дата,
	               |	ПродажиПоСтраховымПолисам.Регистратор КАК ДокументПродажи
	               |ИЗ
	               |	РегистрНакопления.ПродажиПоСтраховымПолисам КАК ПродажиПоСтраховымПолисам
	               |ГДЕ
	               |	ПродажиПоСтраховымПолисам.Период МЕЖДУ &ПериодНач И &ПериодКон
				   |	И ПродажиПоСтраховымПолисам.Филиал.Организация = &Организация
	               |	И (ПродажиПоСтраховымПолисам.Полис.ВидПолиса В
	               |				(ВЫБРАТЬ
	               |					ВидыПолисов.ВидПолиса
	               |				ИЗ
	               |					ВидыПолисов КАК ВидыПолисов
	               |				ГДЕ
	               |					НЕ ВидыПолисов.РеестрТребуетМедицинскихПараметров)
	               |			ИЛИ ПродажиПоСтраховымПолисам.Полис.ВидПолиса В
	               |					(ВЫБРАТЬ
	               |						ВидыПолисов.ВидПолиса
	               |					ИЗ
	               |						ВидыПолисов КАК ВидыПолисов
	               |					ГДЕ
	               |						ВидыПолисов.РеестрТребуетМедицинскихПараметров)
	               |				И НЕ ПродажиПоСтраховымПолисам.Регистратор В
	               |						(ВЫБРАТЬ
	               |							ДокументыПродажСПараметрами.Документ
	               |						ИЗ
	               |							ДокументыПродажСПараметрами КАК ДокументыПродажСПараметрами))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиСПараметрами.Документ КАК ДокументПродажи,
	               |	ПродажиСПараметрами.Дата,
	               |	ПродажиСПараметрами.Диагноз,
	               |	ПродажиСПараметрами.Зуб,
	               |	ПродажиСПараметрами.СегментЗуба,
	               |	ПродажиСПараметрами.Комментарий,
	               |	ПродажиСПараметрами.Номенклатура,
	               |	ПродажиСПараметрами.Количество,
	               |	ПродажиСПараметрами.Сумма,
	               |	ПродажиСПараметрами.Сотрудник,
	               |	ПродажиСПараметрами.Полис,
	               |	ПродажиСПараметрами.Клиент
	               |ИЗ
	               |	ПродажиСПараметрами КАК ПродажиСПараметрами
	               |ГДЕ
	               |	ПродажиСПараметрами.Проверено";
	
	Запрос.УстановитьПараметр("ПериодНач", НачалоПериода);
	Запрос.УстановитьПараметр("ПериодКон", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("СоглашениеСтрахования", ДокументОбъект.Соглашение);
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Соглашение.Организация);

	Результат = Запрос.ВыполнитьПакет();
	ВыборкаСПараметрами = Результат[4].Выбрать();
	ВыборкаБезПараметров = Результат[3].Выбрать();
	
	Пока ВыборкаСПараметрами.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДокументОбъект.Услуги.Добавить(),ВыборкаСПараметрами);	
	КонецЦикла;
	
	Пока ВыборкаБезПараметров.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДокументОбъект.Услуги.Добавить(),ВыборкаБезПараметров);	
	КонецЦикла;
	
	ДокументОбъект.Услуги.Сортировать("Клиент, Дата, Номенклатура");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьРеестраОказаныхУслуг(СсылкаНаОбъект)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеестрОказанныхУслуг_РеестрОказаныхУслуг";
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Макет = ПолучитьМакет("Макет");
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	Шапка.Параметры.Контрагент = ?(ЗначениеЗаполнено(СсылкаНаОбъект.Контрагент.НаименованиеПолное),СсылкаНаОбъект.Контрагент.НаименованиеПолное,СсылкаНаОбъект.Контрагент.Наименование);
	Шапка.Параметры.Соглашение = СсылкаНаОбъект.Соглашение;
	Шапка.Параметры.ДатаНач = Формат(СсылкаНаОбъект.НачалоПериода,"ДФ=dd.MM.yyyy");
	Шапка.Параметры.ДатаКон = Формат(СсылкаНаОбъект.КонецПериода,"ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(Шапка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеестрОказанныхУслугПоСоглашениямУслуги.НомерСтроки КАК Номер,
	               |	РеестрОказанныхУслугПоСоглашениямУслуги.Клиент.Фамилия КАК Фамилия,
	               |	РеестрОказанныхУслугПоСоглашениямУслуги.Клиент.Имя КАК Имя,
	               |	РеестрОказанныхУслугПоСоглашениямУслуги.Клиент.Отчество КАК Отчество,
	               |	РеестрОказанныхУслугПоСоглашениямУслуги.Полис КАК Полис,
				   |	РеестрОказанныхУслугПоСоглашениямУслуги.Полис.Серия КАК ПолисСерия,
				   |	РеестрОказанныхУслугПоСоглашениямУслуги.Полис.Номер КАК ПолисНомер,
	               |	РеестрОказанныхУслугПоСоглашениямУслуги.Дата КАК Дата,
	               |	РеестрОказанныхУслугПоСоглашениямУслуги.Номенклатура.Артикул КАК КодУслуги,
	               |	РеестрОказанныхУслугПоСоглашениямУслуги.Номенклатура.Наименование КАК Наименование,
	               |	РеестрОказанныхУслугПоСоглашениямУслуги.Количество КАК Количество,
	               |	РеестрОказанныхУслугПоСоглашениямУслуги.Сумма КАК Сумма,
	               |	РеестрОказанныхУслугПоСоглашениямУслуги.Диагноз.КодДиагноза КАК Диагноз
	               |ИЗ
	               |	Документ.РеестрОказанныхУслугПоСоглашениям.Услуги КАК РеестрОказанныхУслугПоСоглашениямУслуги
	               |ГДЕ
	               |	РеестрОказанныхУслугПоСоглашениямУслуги.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ОбщаяСумма = 0;
	СтрокаУслуг = Макет.ПолучитьОбласть("СтрокаТаблицы");
	Пока Выборка.Следующий() Цикл
	    ОбщаяСумма = ОбщаяСумма + Выборка.Сумма; 
		ЗаполнитьЗначенияСвойств(СтрокаУслуг.Параметры,Выборка);
		
		ДанныеПолиса = Новый Структура("Ссылка, Серия, Номер", Выборка.Полис, Выборка.ПолисСерия, Выборка.ПолисНомер);
		СтрокаУслуг.Параметры.СерияНомер = МедицинскоеСтрахование.ПредставлениеПолисаДляПечати(ДанныеПолиса);
		
		ТабДокумент.Вывести(СтрокаУслуг);
	КонецЦикла;
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.Итого = Формат(ОбщаяСумма,"ЧДЦ=2");
	Подвал.Параметры.Прописью = ОбщегоНазначения.СформироватьСуммуПрописью(ОбщаяСумма,УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВалютаУчета"));
	Подвал.Параметры.Комментарий = СсылкаНаОбъект.Комментарий;
	
	Сотрудник = СсылкаНаОбъект.Ответственный.Сотрудник;
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Подвал.Параметры.Ответственный = ОбщегоНазначения.ФамилияИнициалыФизЛица(Сотрудник);
	Иначе
		Подвал.Параметры.Ответственный = "_______________________";
	КонецЕсли;
	
	ТабДокумент.Вывести(Подвал);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьРеестраОказаныхУслуг()

#КонецОбласти
